Revit 2027 API
ParameterTypeId.LinearDimType Property
 "Dimension String Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId LinearDimType { get; }
Public Shared ReadOnly Property LinearDimType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ LinearDimType {
	ForgeTypeId^ get ();
}
static member LinearDimType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace